Src/OpenFOAM/OpenFOAM-5.x-master/tutorials/basic/potentialFoam/pitzDaily/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

cp -r 0.orig 0 > /dev/null 2>&1
runApplication blockMesh
runApplication $application -writePhi -writep
runApplication postProcess -func streamFunction

#------------------------------------------------------------------------------
